from ipaddress import *

net = ip_network('172.118.1.255/255.255.252.0', 0)

for ip in net:
    b = f'{ip:b}'

    print(ip)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from ipaddress import *   #  <===   найти адрес сети

net = ip_network('134.12.171.214/255.255.248.0', 0)
print(net)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from ipaddress import * # < ===== поиск маски через айпи узла и адреса сети

for mask in range(33):
    net = ip_network(f'220.128.112.142/{mask}', 0)
    print(net, net.netmask)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from ipaddress import *  # 111.81.192.0/18 255.255.192.0 <== ответ наименьший слева байт майски найти
                          #111.81.192.0/19 255.255.224.0

for mask in range(33):
    net = ip_network(f'111.81.208.27/{mask}', 0)
    print(net, net.netmask)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from ipaddress import *
                                        # 148.195.140.0/22 255.255.252.0 <== ответ
                                                                    # найти наименьшее кол во едениц в маске
                                       # 148.195.140.0/23 255.255.254.0
                                       # 148.195.140.0/24 255.255.255.0
                                       # 148.195.140.0/25 255.255.255.128
                                       # 148.195.140.0/26 255.255.255.192
                                       # 148.195.140.0/27 255.255.255.224
for mask in range(33):
    net = ip_network(f'148.195.140.28/{mask}', 0)
    print(net, net.netmask)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

from ipaddress import *         #241.185.252.0/22 255.255.252.0
                                #241.185.252.0/23 255.255.254.0 <=== кол во нулей 32 - 23 = ответ 9
                                # найти наименьшее кол во нулей в маске
for mask in range(33):
    net = ip_network(f'241.185.253.57/{mask}', 0)
    print(net, net.netmask)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


from ipaddress import * #найти все подходящие значения маски ответ 11

for mask in range(33):
    net = ip_network(f'76.155.48.2/{mask}', 0)
    print(net, net.netmask)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

from ipaddress import *  # два узла находятся в одной сети , найти наибольшее значения 3 слева байта маски
                         # ответом будет 224

for mask in range(33):
    net = ip_network(f'112.117.107.70/{mask}', 0)
    net2 = ip_network(f'112.117.121.80/{mask}', 0)
    if net == net2:
        print(net, net.netmask)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

from ipaddress import *  # адреса находятся в разных узлах и отличается от равности знаком
                        # найти минимальное кол во едениц ответ 21

for mask in range(33):
    net1 = ip_network(f'157.127.182.76/{mask}', 0)
    net2 = ip_network(f'157.127.190.80/{mask}', 0)
    if net1 != net2:
        print(net1, net1.netmask)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from ipaddress import *                 #по маске найти количество адресов: ответ 510

net = ip_network('0.0.0.0/255.255.254.0')
print(net.num_addresses - 2)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from ipaddress import *                       #наибольшое кол во адресов в сети: ответ 64

for mask in range(33):
    net = ip_network(f'108.133.75.91/{mask}', 0)
    print(net, net.num_addresses)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from ipaddress import *            #сколько сущ различных значений маски если в этой сети не менее 60 узлов
                                   # посчиать кол во адресов к подходящей маске ответ: 7
for mask in range(33):
    net = ip_network(f'175.122.80.12/{mask}', 0)
    if net.num_addresses >= 60:
        print(net)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from ipaddress import *                  # сколько в этой сети айпи адресов
                                         #  у которых в двоичной записи есть 3 подряд идущих едениц
                                         # ответ 16
k = 0
net = ip_network('184.178.54.144/255.255.255.240')
for ip in net:
    b = f'{ip:b}'
    if '111' in b:
        k += 1
print(k)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from ipaddress import *                          # сколько айпи адресов которые
                                                 # оканчиваются на 11: ответ 8

k = 0

net = ip_network('211.48.136.64/255.255.255.224', 0)
for ip in net:
    b = f'{ip:b}'
    if b[-2] + b[-1] == '11':
        k += 1
print(k)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

from ipaddress import *

net = ip_network('192.168.156.235/255.255.255.240', 0)
print(net) #192.168.156.224 <= узнали адрес сети

ip1 = ip_address('192.168.156.235')
ip2 = ip_address('192.168.156.224')
print(int(ip1) - int(ip2)) # нашли адрес компьютера
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

from ipaddress import *                         # айпи адрес не принципиален можно любой
                                                # сколько в этой сети айпи адресов , для которых
                                                # числ знач кратно 4 : ответ 8192

net = ip_network('192.168.0.0/255.255.128.0', 0)
k = 0
for ip in net:
    if int(ip) % 4 == 0:
        k += 1
print(k)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from ipaddress import*

net = ip_network('142.68.56.0/255.255.255.240', 0)
k = 0
for ip in net:
    b = f'{ip:b}'
    s = b[:16]
    j = b[16:]
    if s.count('1') < j.count('1'):
        k += 1
print(k)
