a = [int(x) for x in open('17.txt')]

ans = []

for i in range(len(a)):
    if (a[i] % 10 == 2 or a[i] % 10 == 7) and a[i] % 3 == 0 and a[i] % 11 == 0:
        ans.append(a[i])
print(len(ans), min(ans))

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

a = [int(c) for c in open('17.txt')] #пар элементов последовательности

ans = []

for i in range(len(a) - 1):
    for j in range(i + 1, len(a)):
        if ((a[i] + a[j]) % 60 == 0) and ((a[i] % 40 == 0) or (a[j] % 40 == 0)):
            ans.append(a[i] + a[i])
print(len(ans), max(ans))

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

a = [int(x) for x in open('17.txt')]
ans = []
max1 = max(x for x in a if x % 100 == 17)
for i in range(len(a) - 2):
    if (((len(str(a[i])) == 4) + (len(str(a[i + 1])) == 4) + (len(str(a[i + 2])) == 4)) == 2) and (a[i] % 5 == 0 or a[i + 1] % 5 == 0 or a[i + 2] % 5 == 0) and a[i] + a[i + 1] + a[i + 2] > max1:
            ans.append(a[i] + a[i + 1] + a[i + 2])
print(len(ans), max(ans))

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

s = sum([int(i) for x in a if x % 49 == 0 for i in str(a)])  # сумма цифр всех чисел, делящихся на 49

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
a = [int(x) for x in open('1312')]
ans = []

for i in range(len(a) - 1):
    if (a[i] ** 2 + a[i + 1] ** 2) % 2 != 0 and a[i]**2 + a[i]**2 < 80:
        ans.append( [a[i], a[i + 1]])
m = max(ans, key = sum)  # минимальное число из максимальной пары последовательности
print(len(ans), max(m))



a = [int(x) for x in open('17.txt')]
ans = []

for i in range(2, len(a) - 3):
    s1 = a[i - 2] + a[i - 1]
    s2 = a[i] + a[i + 1]
    s3 = a[i + 2] + a[i + 3]
    if s2 > s1 and s2 > s3 and s1 > 0 and s2 > 0 and s3 > 0:
        ans.append(a[i] * a[i + 1])
print(len(ans), min(ans))
