s = open('f;laskjdfl;sjkd)').readline()        # комбинация kot c буквой I

print(s.count('IKOT') + s.count('KOTI') - s.count('IKOTI'))
----------------------------------------------------------------------------------------------------------------

s = open('lkjsldfjk').readline()

print(s.count('K') - s.count('KOT'))
----------------------------------------------------------------------------------------------------------------

s = open(';lasdjkfls').readline()

k = 0
for i in range(len(s) - 3):
    if s[i] + s[i + 1] + s[i + 2] + s[i + 3] == '22222':
        k += 1
print(k)
----------------------------------------------------------------------------------------------------------------
k = 0
for c in 'QWERTYUIOPASDFGHJKLZXCVBNM':
    s1 = 'A' + c + 'EX'
    k += c.count(s1)
print(k)

s = open('alk;sjdf').readline()

k = 0
for i in range(len(s) - 3):
    if s[i] + s[i + 2] + s[i + 3] == 'AEX':
        k += 1
print(k)
----------------------------------------------------------------------------------------------------------------
if s[i] == 'B' and s[i + 2] == 'X' and s[i + 4] == 'A':
----------------------------------------------------------------------------------------------------------------
s = 'FLAKSJ'      # буква которая встречается чаще всего
                  # и которая стоит в алфавите первой

d = {x : s.count(x) for x in sorted(set(s))}

m = 0
c = ''
for x in d:
    if d[x] > m:
        m = d[x]
        c = x
print(c, m)
----------------------------------------------------------------------------------------------------------------

s = 'FLAKSJ'      # буква которая встречается реже всего
                  # и которая стоит в алфавите последней

d = {x : s.count(x) for x in sorted(set(s))}

m = 10**10
c = ''
for x in d:
    if d[x] <= m:
        m = d[x]
        c = x
print(c, m)
----------------------------------------------------------------------------------------------------------------

k = 0
for s in open('al;jskdjflskjd'):
    if s.count('J') > s.count('E'):
        k += 1
print(k)
----------------------------------------------------------------------------------------------------------------

k = 0
for s in open('alskdjflskjf'):
    k1 = 0
    for i in range(len(s) - 3):
        if s[i] == 'Z' and s[i + 2] == 'R' and s[i + 3] == 'O':
            k1 += 1
    if k1 > 0:
        k += 1
print(k)
----------------------------------------------------------------------------------------------------------------

s = open('jl;afskjdfl').readline().strip()
d = {x: 0 for x in sorted(set(s))}

for i in range(len(s) - 1):
    if s[i] == 'A':
        d[s[i + 1]] += 1

m = 0
c = ''
for i in d:
    if d[i] > m:
        m = d[i]
        c = i

print(c, m)
----------------------------------------------------------------------------------------------------------------
s = open('24_1143.txt').readline()

k , z, m = 0, 0, 0
y = 0
for i in range(len(s) - 6):
    if s[i] + s[i + 6] == 'AF': k += 1
for i in range(len(s) - 7):
    if s[i] + s[i + 7] == 'AF': z += 1
for i in range(len(s) - 8):
    if s[i] + s[i + 8] == 'AF': m += 1
for i in range(len(s) - 9):
    if s[i] + s[i + 9] == 'AF': y += 1
print(k + z + m + y)